espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/util/third_party/crypto/sl_component/sl_psa_driver/src/sli_cryptoacc_transparent_driver_aead.c
      // Check length of plaintext.
    {
      unsigned char q = 16 - 1 - (unsigned char) nonce_length;
      if (q < sizeof(plaintext_length)
          && plaintext_length >= (1UL << (q * 8))) {
        return PSA_ERROR_INVALID_ARGUMENT;
      }
    }

      status = cryptoacc_management_acquire();
      if (status != PSA_SUCCESS) {
        return status;
      }
      sx_ret = sx_aes_ccm_encrypt(&key,
                                  &data_in,
                                  &data_out,
                                  &nonce_internal,
                                  &tag_block,
                                  &aad_block);
      status = cryptoacc_management_release();
      if (sx_ret != CRYPTOLIB_SUCCESS
          || status != PSA_SUCCESS) {
        return PSA_ERROR_HARDWARE_FAILURE;
      }

      return_status = PSA_SUCCESS;
      break;
#endif // PSA_WANT_ALG_CCM
#if defined(PSA_WANT_ALG_GCM)
    case PSA_ALG_AEAD_WITH_SHORTENED_TAG(PSA_ALG_GCM, 0):
      if (nonce_length == AES_IV_GCM_SIZE) {
        uint8_t tagbuf[16];
        tag_block = block_t_convert(tagbuf, sizeof(tagbuf));

        status = cryptoacc_management_acquire();
        if (status != PSA_SUCCESS) {
          return status;
        }
        sx_ret = sx_aes_gcm_encrypt(&key,
                                    &data_in,
                                    &data_out,
                                    &nonce_internal,
                                    &tag_block,
                                    &aad_block);
        status = cryptoacc_management_release();
        if (sx_ret != CRYPTOLIB_SUCCESS
            || status != PSA_SUCCESS) {
          return PSA_ERROR_HARDWARE_FAILURE;
        }
        // Copy only requested part of computed tag to user output buffer.
        memcpy(tag, tagbuf, *tag_length);
        return_status = PSA_SUCCESS;
      }
#if defined(SLI_PSA_SUPPORT_GCM_IV_CALCULATION)
      else {
        return_status = sli_cryptoacc_software_gcm(key_buffer, PSA_BITS_TO_BYTES(key_bits),
                                                   nonce, nonce_length,
                                                   additional_data, additional_data_length,
                                                   plaintext,
                                                   ciphertext,
                                                   plaintext_length,
                                                   *tag_length,
                                                   tag,
                                                   true);
      }
#else // SLI_PSA_SUPPORT_GCM_IV_CALCULATION
      else {
        return_status = PSA_ERROR_NOT_SUPPORTED;
      }
#endif // SLI_PSA_SUPPORT_GCM_IV_CALCULATION
      break;
#endif // PSA_WANT_ALG_GCM
  }

  if (return_status == PSA_SUCCESS) {
    *ciphertext_length = plaintext_length;
  } else {
    *ciphertext_length = 0;
    *tag_length = 0;
  }

  return return_status;

#else // PSA_WANT_ALG_CCM || PSA_WANT_ALG_GCM

  (void)attributes;
  (void)key_buffer;
  (void)key_buffer_size;
  (void)alg;
  (void)nonce;
  (void)nonce_length;
  (void)additional_data;
  (void)additional_data_length;
  (void)plaintext;
  (void)plaintext_length;
  (void)ciphertext;
  (void)ciphertext_size;
  (void)ciphertext_length;
  (void)tag;
  (void)tag_size;
  (void)tag_length;

  return PSA_ERROR_NOT_SUPPORTED;

#endif // PSA_WANT_ALG_CCM || PSA_WANT_ALG_GCM
}

psa_status_t sli_cryptoacc_transparent_aead_decrypt_tag(const psa_key_attributes_t *attributes,
                                                        const uint8_t *key_buffer,
                                                        size_t key_buffer_size,
                                                        psa_algorithm_t alg,
                                                        const uint8_t *nonce,
                                                        size_t nonce_length,
                                                        const uint8_t *additional_data,
                                                        size_t additional_data_length,
                                                        const uint8_t *ciphertext,
                                                        size_t ciphertext_length,
                                                        const uint8_t* tag,
                                                        size_t tag_length,
                                                        uint8_t *plaintext,
                                                        size_t plaintext_size,
                                                        size_t *plaintext_length)
{
#if defined(PSA_WANT_ALG_CCM) || defined(PSA_WANT_ALG_GCM)
  if (attributes == NULL
      || key_buffer == NULL
      || nonce == NULL
      || (additional_data == NULL && additional_data_length > 0)
      || (ciphertext == NULL && ciphertext_length > 0)
      || (plaintext == NULL && plaintext_size > 0)
      || plaintext_length == NULL
      || tag == NULL) {
    return PSA_ERROR_INVALID_ARGUMENT;
  }

  // Verify that the driver supports the given parameters.
  size_t key_bits = psa_get_key_bits(attributes);
  psa_status_t status = check_aead_parameters(attributes, alg, nonce_length, additional_data_length);
  if (status != PSA_SUCCESS) {
    return status;
  }

  // Check input-key size.
  if (key_buffer_size < PSA_BITS_TO_BYTES(key_bits)) {
    return PSA_ERROR_INVALID_ARGUMENT;
  }

  // Check sufficient output buffer size.
  if (plaintext_size < ciphertext_length) {
    return PSA_ERROR_BUFFER_TOO_SMALL;
  }

  // Our drivers only support full or no overlap between input and output
  // buffers. So in the case of partial overlap, copy the input buffer into
  // the output buffer and process it in place as if the buffers fully
  // overlapped.
  if ((plaintext > ciphertext) && (plaintext < (ciphertext + ciphertext_length))) {
    memmove(plaintext, ciphertext, ciphertext_length);
    ciphertext = plaintext;
  }

  psa_status_t return_status = PSA_ERROR_CORRUPTION_DETECTED;
  uint32_t sx_ret = CRYPTOLIB_CRYPTO_ERR;
  block_t key = NULL_blk;
  block_t aad_block = NULL_blk;
  block_t tag_block = NULL_blk;
  block_t nonce_internal = NULL_blk;
  block_t data_in = NULL_blk;
  block_t data_out = NULL_blk;
  switch (PSA_ALG_AEAD_WITH_SHORTENED_TAG(alg, 0)) {
#if defined(PSA_WANT_ALG_CCM)
    case PSA_ALG_AEAD_WITH_SHORTENED_TAG(PSA_ALG_CCM, 0):

    {
      // Check length of ciphertext.
      unsigned char q = 16 - 1 - (unsigned char) nonce_length;
      if (q < sizeof(ciphertext_length)
          && ciphertext_length >= (1UL << (q * 8))) {
        return PSA_ERROR_INVALID_ARGUMENT;
      }
    }

      key = block_t_convert(key_buffer, PSA_BITS_TO_BYTES(key_bits));
      aad_block = block_t_convert(additional_data, additional_data_length);
      tag_block = block_t_convert(tag, tag_length);
      nonce_internal = block_t_convert(nonce, nonce_length);
      data_in = block_t_convert(ciphertext, ciphertext_length);
      data_out = block_t_convert(plaintext, ciphertext_length);

      status = cryptoacc_management_acquire();
      if (status != PSA_SUCCESS) {
        return status;
      }
      sx_ret = sx_aes_ccm_decrypt_verify(&key,
                                         &data_in,
                                         &data_out,
                                         &nonce_internal,
                                         &tag_block,
                                         &aad_block);
      status = cryptoacc_management_release();
      if (sx_ret == CRYPTOLIB_INVALID_SIGN_ERR) {
        return_status = PSA_ERROR_INVALID_SIGNATURE;
      } else if (sx_ret != CRYPTOLIB_SUCCESS || status != PSA_SUCCESS) {
        return_status = PSA_ERROR_HARDWARE_FAILURE;
      } else {
        *plaintext_length = ciphertext_length;
        return_status = PSA_SUCCESS;
      }
      break;
#endif // PSA_WANT_ALG_CCM
#if defined(PSA_WANT_ALG_GCM)
    case PSA_ALG_AEAD_WITH_SHORTENED_TAG(PSA_ALG_GCM, 0):
    {
      uint8_t tagbuf[16];
      uint32_t diff = 0;

      if (nonce_length == AES_IV_GCM_SIZE) {
        key = block_t_convert(key_buffer, PSA_BITS_TO_BYTES(key_bits));
        aad_block = block_t_convert(additional_data, additional_data_length);
        tag_block = block_t_convert(tagbuf, sizeof(tagbuf));
        nonce_internal = block_t_convert(nonce, nonce_length);
        data_in = block_t_convert(ciphertext, ciphertext_length);
        data_out = block_t_convert(plaintext, ciphertext_length);

        status = cryptoacc_management_acquire();
        if (status != PSA_SUCCESS) {
          return status;
        }
        sx_ret = sx_aes_gcm_decrypt(&key,
                                    &data_in,
                                    &data_out,
                                    &nonce_internal,
                                    &tag_block,
                                    &aad_block);
        status = cryptoacc_management_release();
        if (sx_ret != CRYPTOLIB_SUCCESS || status != PSA_SUCCESS) {
          return_status = PSA_ERROR_HARDWARE_FAILURE;
        } else {
          // Check that the provided tag equals the calculated one
          // (in constant time). Note that the tag returned by ccm_auth_crypt
          // is encrypted, so we don't have to decrypt the tag.
          diff = sli_psa_safer_memcmp(tag, tagbuf, tag_length);
          sli_psa_zeroize(tagbuf, tag_length);

          if (diff != 0) {
            return_status = PSA_ERROR_INVALID_SIGNATURE;
          } else {
            *plaintext_length = ciphertext_length;
            return_status = PSA_SUCCESS;
          }

          break;
        }
      }
#if defined(SLI_PSA_SUPPORT_GCM_IV_CALCULATION)
      else {
        return_status = sli_cryptoacc_software_gcm(key_buffer, PSA_BITS_TO_BYTES(key_bits),
                                                   nonce, nonce_length,
                                                   additional_data, additional_data_length,
                                                   ciphertext,
                                                   plaintext,
                                                   ciphertext_length,
                                                   tag_length,
                                                   (uint8_t*)tag,
                                                   false);
        if (return_status == PSA_SUCCESS) {
          *plaintext_length = ciphertext_length;
        }
      }
#else // SLI_PSA_SUPPORT_GCM_IV_CALCULATION
      else {
        return_status = PSA_ERROR_NOT_SUPPORTED;
      }
#endif // SLI_PSA_SUPPORT_GCM_IV_CALCULATION
      break;
    }
#endif // PSA_WANT_ALG_GCM
    default:
      return PSA_ERROR_NOT_SUPPORTED;
  }

  if (return_status != PSA_SUCCESS) {
    *plaintext_length = 0;
    sli_psa_zeroize(plaintext, plaintext_size);
  }

  return return_status;

#else // PSA_WANT_ALG_CCM || PSA_WANT_ALG_GCM

  (void)attributes;
  (void)key_buffer;
  (void)key_buffer_size;
  (void)alg;
  (void)nonce;
  (void)nonce_length;
  (void)additional_data;
  (void)additional_data_length;
  (void)plaintext;
  (void)plaintext_size;
  (void)plaintext_length;
  (void)ciphertext;
  (void)ciphertext_length;
  (void)tag;
  (void)tag_length;

  return PSA_ERROR_NOT_SUPPORTED;

