espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/util/third_party/crypto/sl_component/sl_psa_driver/src/sli_cryptoacc_transparent_driver_aead.c
  block_t ctx_out_block = block_t_convert(operation->ctx.xcm_ctx, sizeof(operation->ctx.xcm_ctx));

  block_t key = block_t_convert(operation->key, operation->key_len);
  block_t aad_block = block_t_convert(input, input_length);
  block_t nonce_block = block_t_convert(operation->ctx.preinit.nonce, operation->ctx.preinit.nonce_length);
  block_t data_in = NULL_blk;
  block_t data_out = NULL_blk;

  // Get ownership.
  return_status = cryptoacc_management_acquire();
  if (return_status != PSA_SUCCESS) {
    return return_status;
  }

  switch (PSA_ALG_AEAD_WITH_SHORTENED_TAG(alg, 0)) {
#if defined(PSA_WANT_ALG_CCM)
    case PSA_ALG_AEAD_WITH_SHORTENED_TAG(PSA_ALG_CCM, 0):
    {
      uint32_t tag_length = PSA_ALG_AEAD_GET_TAG_LENGTH(operation->alg);
      if (operation->direction == SLI_AES_ENC) {
        // CCM finish must have input data, in the case of pt_len = 0 and aad_len != 0 we
        // need to precompute the tag. (Only needed for encrypt)
        if (operation->total_length == 0) {
          block_t tag_block = block_t_convert(operation->ctx.tag_buf, tag_length);
          sx_ret = sx_aes_ccm_encrypt(&key,
                                      &data_in,
                                      &data_out,
                                      &nonce_block,
                                      &tag_block,
                                      &aad_block);

          goto exit;
        } else {
          sx_ret = sx_aes_ccm_encrypt_init(&key,
                                           &data_in,
                                           &data_out,
                                           &nonce_block,
                                           &ctx_out_block,
                                           &aad_block,
                                           tag_length,
                                           operation->total_length);
        }
      } else {
        sx_ret = sx_aes_ccm_decrypt_init(&key,
                                         &data_in,
                                         &data_out,
                                         &nonce_block,
                                         &ctx_out_block,
                                         &aad_block,
                                         tag_length,
                                         operation->total_length);
      }
      break;
    }
#endif//PSA_WANT_ALG_CCM
#if defined (PSA_WANT_ALG_GCM)
    case PSA_ALG_AEAD_WITH_SHORTENED_TAG(PSA_ALG_GCM, 0):
      if (operation->direction == SLI_AES_ENC) {
        sx_ret = sx_aes_gcm_encrypt_init(&key,
                                         &data_in,
                                         &data_out,
                                         &nonce_block,
                                         &ctx_out_block,
                                         &aad_block);
      } else {
        sx_ret = sx_aes_gcm_decrypt_init(&key,
                                         &data_in,
                                         &data_out,
                                         &nonce_block,
                                         &ctx_out_block,
                                         &aad_block);
      }
      goto exit;
      break;
#endif//PSA_WANT_ALG_GCM
  }

  exit:

  // Release ownership.
  return_status = cryptoacc_management_release();
  if (sx_ret != CRYPTOLIB_SUCCESS || return_status != PSA_SUCCESS ) {
    return PSA_ERROR_HARDWARE_FAILURE;
  }

  operation->ad_len += input_length;
  return PSA_SUCCESS;
}
#endif //PSA_WANT_ALG_CCM || PSA_WANT_ALG_GCM

psa_status_t sli_cryptoacc_transparent_aead_update_ad(sli_cryptoacc_transparent_aead_operation_t *operation,
                                                      const uint8_t *input,
                                                      size_t input_length)
{
  #if defined(PSA_WANT_ALG_CCM) || defined(PSA_WANT_ALG_GCM)

  if (operation == NULL
      || (input == NULL && input_length > 0)) {
    return PSA_ERROR_INVALID_ARGUMENT;
  }

  if (operation->alg == 0) {
    return PSA_ERROR_BAD_STATE;
  }

  if (operation->ad_len > 0 || operation->processed_len > 0) {
    return PSA_ERROR_BAD_STATE;
  }

  // No additional data.
  if (input_length == 0) {
    return PSA_SUCCESS;
  }

  return cryptoacc_aead_start(operation, input, input_length);
#else //PSA_WANT_ALG_CCM || PSA_WANT_ALG_GCM

  (void)operation;
  (void)input;
  (void)input_length;
  return PSA_ERROR_NOT_SUPPORTED;
#endif//PSA_WANT_ALG_CCM || PSA_WANT_ALG_GCM
}

psa_status_t sli_cryptoacc_transparent_aead_update(sli_cryptoacc_transparent_aead_operation_t *operation,
                                                   const uint8_t *input,
                                                   size_t input_length,
                                                   uint8_t *output,
                                                   size_t output_size,
                                                   size_t *output_length)
{
  #if defined(PSA_WANT_ALG_CCM) || defined(PSA_WANT_ALG_GCM)

  if (output_size < input_length) {
    return PSA_ERROR_BUFFER_TOO_SMALL;
  }

  if (operation == NULL
      || ((input == NULL || output == NULL) && input_length > 0)
      || output_length == NULL) {
    return PSA_ERROR_INVALID_ARGUMENT;
  }

  if (operation->alg == 0) {
    return PSA_ERROR_BAD_STATE;
  }

  // Check variable overflow
  if (operation->processed_len > 0xFFFFFFFF - input_length) {
    return PSA_ERROR_INVALID_ARGUMENT;
  }

  *output_length = 0;

  if (input_length == 0) {
    return PSA_SUCCESS;
  }

  psa_algorithm_t alg = operation->alg;

  psa_status_t return_status = PSA_ERROR_CORRUPTION_DETECTED;
  uint32_t sx_ret = CRYPTOLIB_CRYPTO_ERR;

  block_t key = block_t_convert(operation->key, operation->key_len);

  block_t ctx_in_block = block_t_convert(operation->ctx.xcm_ctx, sizeof(operation->ctx.xcm_ctx));
  block_t ctx_out_block = block_t_convert(operation->ctx.xcm_ctx, sizeof(operation->ctx.xcm_ctx));

  block_t input_block = block_t_convert(input, input_length);
  block_t output_block = block_t_convert(output, input_length);

  block_t nonce_block = NULL_blk;
  block_t aad_block = NULL_blk;

  // The extra logic is to support non-blocksize input data.

  // Store data in context if there is space in the data buffer.
  if ((input_length + operation->final_data_length) < 16 && input_length < 16) {
    if (operation->final_data_length > 16) {
      // Invalid context.
      return PSA_ERROR_INVALID_ARGUMENT;
    }

    memcpy(operation->final_data + operation->final_data_length, input, input_length);
    operation->final_data_length += input_length;
    return PSA_SUCCESS;
  }

