espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/util/third_party/crypto/sl_component/sl_psa_driver/src/sli_cryptoacc_transparent_driver_aead.c
  uint8_t input_offset = 0;

#if defined(PSA_WANT_ALG_CCM)
  uint32_t tag_length = PSA_ALG_AEAD_GET_TAG_LENGTH(operation->alg);
#endif

  if (operation->ad_len == 0 && operation->processed_len == 0) {
    // Operation is not initialized.
    nonce_block = block_t_convert(operation->ctx.preinit.nonce, operation->ctx.preinit.nonce_length);
  }

  if (operation->final_data_length) {
    if (operation->final_data_length > 16) {
      // Invalid context.
      return PSA_ERROR_INVALID_ARGUMENT;
    }

    // If there is data stored in context: fill final_data buffer and process it first.
    input_offset = 16 - operation->final_data_length;
    memcpy(operation->final_data + operation->final_data_length, input, input_offset);

#if defined(PSA_WANT_ALG_CCM)
    if (PSA_ALG_AEAD_WITH_SHORTENED_TAG(alg, 0) == PSA_ALG_AEAD_WITH_SHORTENED_TAG(PSA_ALG_CCM, 0)) {
      if (operation->processed_len + 16 == operation->total_length) {
        operation->final_data_length = 16;
        return PSA_SUCCESS;
      }
    }
#endif

    block_t input_block_final = block_t_convert(operation->final_data, 16);
    block_t output_block_final = block_t_convert(output, 16);

    return_status = cryptoacc_management_acquire();
    if (return_status != PSA_SUCCESS) {
      return return_status;
    }

    #if defined(PSA_WANT_ALG_GCM)
    if (PSA_ALG_AEAD_WITH_SHORTENED_TAG(alg, 0) == PSA_ALG_AEAD_WITH_SHORTENED_TAG(PSA_ALG_GCM, 0)) {
      if (operation->ad_len == 0 && operation->processed_len == 0) {
        // Not initialized.
        if (operation->direction == SLI_AES_ENC) {
          sx_ret = sx_aes_gcm_encrypt_init(&key,
                                           &input_block_final,
                                           &output_block_final,
                                           &nonce_block,
                                           &ctx_out_block,
                                           &aad_block);
        } else {
          sx_ret = sx_aes_gcm_decrypt_init(&key,
                                           &input_block_final,
                                           &output_block_final,
                                           &nonce_block,
                                           &ctx_out_block,
                                           &aad_block);
        }
      } else {
        if (operation->direction == SLI_AES_ENC) {
          sx_ret = sx_aes_gcm_encrypt_update(&key,
                                             &input_block_final,
                                             &output_block_final,
                                             &ctx_in_block,
                                             &ctx_out_block);
        } else {
          sx_ret = sx_aes_gcm_decrypt_update(&key,
                                             &input_block_final,
                                             &output_block_final,
                                             &ctx_in_block,
                                             &ctx_out_block);
        }
      }
    }
    #endif //PSA_WANT_ALG_GCM

    #if defined(PSA_WANT_ALG_CCM)
    if (PSA_ALG_AEAD_WITH_SHORTENED_TAG(alg, 0) == PSA_ALG_AEAD_WITH_SHORTENED_TAG(PSA_ALG_CCM, 0)) {
      if (operation->ad_len == 0 && operation->processed_len == 0) {
        // Not initialized.
        if (operation->direction == SLI_AES_ENC) {
          sx_ret = sx_aes_ccm_encrypt_init(&key,
                                           &input_block_final,
                                           &output_block_final,
                                           &nonce_block,
                                           &ctx_out_block,
                                           &aad_block,
                                           tag_length,
                                           operation->total_length);
        } else {
          sx_ret = sx_aes_ccm_decrypt_init(&key,
                                           &input_block_final,
                                           &output_block_final,
                                           &nonce_block,
                                           &ctx_out_block,
                                           &aad_block,
                                           tag_length,
                                           operation->total_length);
        }
      } else {
        if (operation->direction == SLI_AES_ENC) {
          sx_ret = sx_aes_ccm_encrypt_update(&key,
                                             &input_block_final,
                                             &output_block_final,
                                             &ctx_in_block,
                                             &ctx_out_block);
        } else {
          sx_ret = sx_aes_ccm_decrypt_update(&key,
                                             &input_block_final,
                                             &output_block_final,
                                             &ctx_in_block,
                                             &ctx_out_block);
        }
      }
    }
    #endif //PSA_WANT_ALG_CCM

    // Release ownership.
    return_status = cryptoacc_management_release();
    if (sx_ret != CRYPTOLIB_SUCCESS || return_status != PSA_SUCCESS ) {
      return PSA_ERROR_HARDWARE_FAILURE;
    }

    operation->final_data_length = 0;
    input_length -= input_offset;
    operation->processed_len += 16;
    output += 16;
    *output_length += 16;
  }

  // Store data in context if there is space in the data buffer.
  if (input_length < 16 && !operation->final_data_length && input_length < 16) {
    memcpy(operation->final_data, input + input_offset, input_length);
    operation->final_data_length = input_length;
    return PSA_SUCCESS;
  }

  // Store data that is not a multiple of 16 in context.
  uint8_t res_data_length = input_length % 16;
  memcpy(operation->final_data, input + input_offset + (input_length - res_data_length), res_data_length);
  operation->final_data_length = res_data_length;
  input_length -= res_data_length;

  // Get ownership.
  return_status = cryptoacc_management_acquire();
  if (return_status != PSA_SUCCESS) {
    return return_status;
  }

