espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/util/third_party/crypto/sl_component/sl_psa_driver/src/sli_cryptoacc_transparent_driver_aead.c
  switch (PSA_ALG_AEAD_WITH_SHORTENED_TAG(alg, 0)) {
      #if defined(PSA_WANT_ALG_CCM)
    case PSA_ALG_AEAD_WITH_SHORTENED_TAG(PSA_ALG_CCM, 0):
      // CCM multipart finish will hardfault without input data, so we must always save
      // some data for the final operation.
      if ((operation->processed_len + input_length) == operation->total_length) {
        memcpy(operation->final_data, input + (input_length - 16), 16);
        operation->final_data_length = 16;
        input_length -= operation->final_data_length;
        if (!input_length) {
          return PSA_SUCCESS;
        }
      }

      input_block = block_t_convert(input + input_offset, input_length);
      output_block = block_t_convert(output, input_length);

      if (operation->ad_len == 0 && operation->processed_len == 0) {
        // Not initialized.
        if (operation->direction == SLI_AES_ENC) {
          sx_ret = sx_aes_ccm_encrypt_init(&key,
                                           &input_block,
                                           &output_block,
                                           &nonce_block,
                                           &ctx_out_block,
                                           &aad_block,
                                           tag_length,
                                           operation->total_length);
        } else {
          sx_ret = sx_aes_ccm_decrypt_init(&key,
                                           &input_block,
                                           &output_block,
                                           &nonce_block,
                                           &ctx_out_block,
                                           &aad_block,
                                           tag_length,
                                           operation->total_length);
        }
      } else {
        if (operation->direction == SLI_AES_ENC) {
          sx_ret = sx_aes_ccm_encrypt_update(&key,
                                             &input_block,
                                             &output_block,
                                             &ctx_in_block,
                                             &ctx_out_block);
        } else {
          sx_ret = sx_aes_ccm_decrypt_update(&key,
                                             &input_block,
                                             &output_block,
                                             &ctx_in_block,
                                             &ctx_out_block);
        }
      }
      break;
      #endif //PSA_WANT_ALG_CCM
      #if defined(PSA_WANT_ALG_GCM)
    case PSA_ALG_AEAD_WITH_SHORTENED_TAG(PSA_ALG_GCM, 0):

      input_block = block_t_convert(input + input_offset, input_length);
      output_block = block_t_convert(output, input_length);

      if (operation->ad_len == 0 && operation->processed_len == 0) {
        // Not initialized.
        if (operation->direction == SLI_AES_ENC) {
          sx_ret = sx_aes_gcm_encrypt_init(&key,
                                           &input_block,
                                           &output_block,
                                           &nonce_block,
                                           &ctx_out_block,
                                           &aad_block);
        } else {
          sx_ret = sx_aes_gcm_decrypt_init(&key,
                                           &input_block,
                                           &output_block,
                                           &nonce_block,
                                           &ctx_out_block,
                                           &aad_block);
        }
      } else {
        if (operation->direction == SLI_AES_ENC) {
          sx_ret = sx_aes_gcm_encrypt_update(&key,
                                             &input_block,
                                             &output_block,
                                             &ctx_in_block,
                                             &ctx_out_block);
        } else {
          sx_ret = sx_aes_gcm_decrypt_update(&key,
                                             &input_block,
                                             &output_block,
                                             &ctx_in_block,
                                             &ctx_out_block);
        }
      }
      break;
      #endif //PSA_WANT_ALG_GCM
    default:
      return PSA_ERROR_NOT_SUPPORTED;
  }
  // Release ownership.
  return_status = cryptoacc_management_release();
  if (sx_ret != CRYPTOLIB_SUCCESS || return_status != PSA_SUCCESS ) {
    return PSA_ERROR_HARDWARE_FAILURE;
  }

  *output_length += input_length;
  operation->processed_len += input_length;
  return return_status;

  #else //PSA_WANT_ALG_CCM || PSA_WANT_ALG_GCM
  (void)operation;
  (void)input;
  (void)input_length;
  (void)output;
  (void)output_size;
  (void)output_length;
  return PSA_ERROR_NOT_SUPPORTED;
  #endif //PSA_WANT_ALG_CCM || PSA_WANT_ALG_GCM
}

psa_status_t sli_cryptoacc_transparent_aead_finish(sli_cryptoacc_transparent_aead_operation_t *operation,
                                                   uint8_t *ciphertext,
                                                   size_t ciphertext_size,
                                                   size_t *ciphertext_length,
                                                   uint8_t *tag,
                                                   size_t tag_size,
                                                   size_t *tag_length)
{
  #if defined(PSA_WANT_ALG_CCM) || defined(PSA_WANT_ALG_GCM)

  if (operation == NULL) {
    return PSA_ERROR_INVALID_ARGUMENT;
  }

  if (ciphertext_size < operation->final_data_length) {
    return PSA_ERROR_BUFFER_TOO_SMALL;
  }
  uint32_t tag_len = PSA_ALG_AEAD_GET_TAG_LENGTH(operation->alg);

  if (tag_size < tag_len) {
    return PSA_ERROR_BUFFER_TOO_SMALL;
  }

  block_t key = block_t_convert(operation->key, operation->key_len);

  uint8_t tagbuf[16];
  block_t tag_block = block_t_convert(tagbuf, sizeof(tagbuf));

  psa_status_t status = PSA_ERROR_CORRUPTION_DETECTED;
  uint32_t sx_ret = CRYPTOLIB_CRYPTO_ERR;

  psa_algorithm_t alg = operation->alg;

  if (operation->direction != SLI_AES_ENC) {
    return PSA_ERROR_INVALID_ARGUMENT;
  }

  if (operation->ad_len == 0 && operation->processed_len == 0) {
    // Operation is not initialized.

    block_t nonce_block = block_t_convert(operation->ctx.preinit.nonce, operation->ctx.preinit.nonce_length);
    block_t data_in = NULL_blk;
    block_t data_out = NULL_blk;
    block_t aad_block = NULL_blk;

    // Get ownership.
    status = cryptoacc_management_acquire();
    if (status != PSA_SUCCESS) {
      return status;
    }
    switch (PSA_ALG_AEAD_WITH_SHORTENED_TAG(alg, 0)) {
      #if defined(PSA_WANT_ALG_CCM)
      case PSA_ALG_AEAD_WITH_SHORTENED_TAG(PSA_ALG_CCM, 0):
      {
        tag_block = block_t_convert(tagbuf, tag_len);
        sx_ret = sx_aes_ccm_encrypt(&key,
                                    &data_in,
                                    &data_out,
                                    &nonce_block,
                                    &tag_block,
                                    &aad_block);
        *ciphertext_length = 0;
        break;
      }
      #endif //PSA_WANT_ALG_CCM
      #if defined(PSA_WANT_ALG_GCM)
      case PSA_ALG_AEAD_WITH_SHORTENED_TAG(PSA_ALG_GCM, 0):
      {
        data_in = block_t_convert(operation->final_data, operation->final_data_length);
        data_out = block_t_convert(ciphertext, operation->final_data_length);
        sx_ret = sx_aes_gcm_encrypt(&key,
                                    &data_in,
                                    &data_out,
                                    &nonce_block,
                                    &tag_block,
                                    &aad_block);
        *ciphertext_length = operation->final_data_length;
        break;
      }
      #endif //PSA_WANT_ALG_GCM
      default:
        return PSA_ERROR_NOT_SUPPORTED;
    }
    // Release ownership.
    status = cryptoacc_management_release();
    if (sx_ret != CRYPTOLIB_SUCCESS || status != PSA_SUCCESS ) {
      *ciphertext_length = 0;
      return PSA_ERROR_HARDWARE_FAILURE;
    }
    memcpy(tag, tagbuf, tag_len);
    return PSA_SUCCESS;
  }

  #if defined(PSA_WANT_ALG_GCM)
  uint32_t lena_lenc[4];
  lena_lenc[0] = __REV(operation->ad_len >> 29);
  lena_lenc[1] = __REV((operation->ad_len << 3) & 0xFFFFFFFFUL);
  lena_lenc[2] = __REV((operation->processed_len + operation->final_data_length) >> 29);
  lena_lenc[3] = __REV(((operation->processed_len + operation->final_data_length) << 3) & 0xFFFFFFFFUL);

  block_t len_a_c = block_t_convert(lena_lenc, sizeof(lena_lenc));
  #endif

  block_t ctx_in_block = block_t_convert(operation->ctx.xcm_ctx, sizeof(operation->ctx.xcm_ctx));

  block_t data_in_block = block_t_convert(operation->final_data, operation->final_data_length);
  block_t data_out_block = block_t_convert(ciphertext, operation->final_data_length);

  // Get ownership.
  status = cryptoacc_management_acquire();
  if (status != PSA_SUCCESS) {
    return status;
  }
  switch (PSA_ALG_AEAD_WITH_SHORTENED_TAG(alg, 0)) {
      #if defined(PSA_WANT_ALG_CCM)
    case PSA_ALG_AEAD_WITH_SHORTENED_TAG(PSA_ALG_CCM, 0):
    {
      if (operation->ad_len != 0 && operation->total_length == 0) {
        // Tag is calculated in update_ad.
        memcpy(tag, operation->ctx.tag_buf, tag_len);
        return PSA_SUCCESS;
      }

