espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/util/third_party/crypto/sl_component/sl_psa_driver/src/sli_cryptoacc_transparent_driver_aead.c
      sx_ret = sx_aes_ccm_encrypt_final(
        &key,
        &data_in_block,
        &data_out_block,
        &ctx_in_block,
        &tag_block);
      break;
    }
      #endif //PSA_WANT_ALG_CCM
      #if defined(PSA_WANT_ALG_GCM)
    case PSA_ALG_AEAD_WITH_SHORTENED_TAG(PSA_ALG_GCM, 0):
    {
      sx_ret = sx_aes_gcm_encrypt_final(
        &key,
        &data_in_block,
        &data_out_block,
        &ctx_in_block,
        &tag_block,
        &len_a_c);
      break;
    }
      #endif //PSA_WANT_ALG_GCM
    default:
      return PSA_ERROR_NOT_SUPPORTED;
  }
  // Release ownership.
  status = cryptoacc_management_release();
  if (sx_ret != CRYPTOLIB_SUCCESS || status != PSA_SUCCESS) {
    return PSA_ERROR_HARDWARE_FAILURE;
  }
  memcpy(tag, tagbuf, tag_size);
  *ciphertext_length = operation->final_data_length;
  *tag_length = tag_len;
  return status;

  #else //PSA_WANT_ALG_CCM || PSA_WANT_ALG_GCM
  (void)operation;
  (void)ciphertext;
  (void)ciphertext_size;
  (void)ciphertext_length;
  (void)tag;
  (void)tag_size;
  (void)tag_length;
  return PSA_ERROR_NOT_SUPPORTED;
  #endif //PSA_WANT_ALG_CCM || PSA_WANT_ALG_GCM)
}

psa_status_t sli_cryptoacc_transparent_aead_verify(sli_cryptoacc_transparent_aead_operation_t *operation,
                                                   uint8_t *plaintext,
                                                   size_t plaintext_size,
                                                   size_t *plaintext_length,
                                                   const uint8_t *tag,
                                                   size_t tag_length)
{
  #if defined(PSA_WANT_ALG_CCM) || defined(PSA_WANT_ALG_GCM)

  if (operation == NULL) {
    return PSA_ERROR_INVALID_ARGUMENT;
  }

  if (tag == NULL || tag_length == 0 ) {
    return PSA_ERROR_INVALID_SIGNATURE;
  }

  if (plaintext_size < operation->final_data_length) {
    return PSA_ERROR_INVALID_ARGUMENT;
  }

  block_t key = block_t_convert(operation->key, operation->key_len);

  psa_status_t status = PSA_ERROR_CORRUPTION_DETECTED;
  uint32_t sx_ret = CRYPTOLIB_CRYPTO_ERR;

  psa_algorithm_t alg = operation->alg;
  if (operation->direction != SLI_AES_DEC) {
    return PSA_ERROR_INVALID_ARGUMENT;
  }

  if (operation->ad_len == 0 && operation->processed_len == 0) {
    // Operation is not initialized.
    block_t nonce_block = block_t_convert(operation->ctx.preinit.nonce, operation->ctx.preinit.nonce_length);
    block_t aad_block = NULL_blk;
    block_t data_in = NULL_blk;
    block_t data_out = NULL_blk;
    // Get ownership.
    status = cryptoacc_management_acquire();
    if (status != PSA_SUCCESS) {
      return status;
    }
    switch (PSA_ALG_AEAD_WITH_SHORTENED_TAG(alg, 0)) {
      #if defined(PSA_WANT_ALG_CCM)
      case PSA_ALG_AEAD_WITH_SHORTENED_TAG(PSA_ALG_CCM, 0):
      {
        block_t tag_block = block_t_convert(tag, tag_length);
        sx_ret = sx_aes_ccm_decrypt_verify(&key,
                                           &data_in,
                                           &data_out,
                                           &nonce_block,
                                           &tag_block,
                                           &aad_block);
        status = cryptoacc_management_release();
        if (sx_ret != CRYPTOLIB_SUCCESS || status != PSA_SUCCESS) {
          return PSA_ERROR_HARDWARE_FAILURE;
        }
        *plaintext_length = 0;
        break;
      }
      #endif//PSA_WANT_ALG_CCM
      #if defined(PSA_WANT_ALG_GCM)
      case PSA_ALG_AEAD_WITH_SHORTENED_TAG(PSA_ALG_GCM, 0):
      {
        block_t tag_block = block_t_convert(tag, tag_length);

        data_in = block_t_convert(operation->final_data, operation->final_data_length);
        data_out = block_t_convert(plaintext, operation->final_data_length);

        sx_ret = sx_aes_gcm_decrypt_verify(&key,
                                           &data_in,
                                           &data_out,
                                           &nonce_block,
                                           &tag_block,
                                           &aad_block);
        status = cryptoacc_management_release();
        if (sx_ret == CRYPTOLIB_INVALID_SIGN_ERR) {
          return PSA_ERROR_INVALID_SIGNATURE;
        }
        if (sx_ret != CRYPTOLIB_SUCCESS || status != PSA_SUCCESS) {
          return PSA_ERROR_HARDWARE_FAILURE;
        }

        *plaintext_length = operation->final_data_length;
        break;
      }
      #endif//PSA_WANT_ALG_GCM
      default:
        return PSA_ERROR_NOT_SUPPORTED;
    }

    return PSA_SUCCESS;
  }

  #if defined(PSA_WANT_ALG_GCM)
  uint32_t lena_lenc[4];
  lena_lenc[0] = __REV(operation->ad_len >> 29);
  lena_lenc[1] = __REV((operation->ad_len << 3) & 0xFFFFFFFFUL);
  lena_lenc[2] = __REV((operation->processed_len + operation->final_data_length) >> 29);
  lena_lenc[3] = __REV(((operation->processed_len + operation->final_data_length) << 3) & 0xFFFFFFFFUL);
  block_t len_a_c = block_t_convert(lena_lenc, sizeof(lena_lenc));
  #endif

  block_t ctx_in_block = block_t_convert(operation->ctx.xcm_ctx, sizeof(operation->ctx.xcm_ctx));
  block_t tag_block = block_t_convert(tag, tag_length);

  block_t data_in_block = block_t_convert(operation->final_data, operation->final_data_length);
  block_t data_out_block = block_t_convert(plaintext, operation->final_data_length);

  // Get ownership.
  status = cryptoacc_management_acquire();
  if (status != PSA_SUCCESS) {
    return PSA_ERROR_HARDWARE_FAILURE;
  }

  switch (PSA_ALG_AEAD_WITH_SHORTENED_TAG(alg, 0)) {
      #if defined(PSA_WANT_ALG_CCM)
    case PSA_ALG_AEAD_WITH_SHORTENED_TAG(PSA_ALG_CCM, 0):
    {
      uint32_t tag_len = PSA_ALG_AEAD_GET_TAG_LENGTH(operation->alg);
      if (tag_length != tag_len) {
        return PSA_ERROR_INVALID_SIGNATURE;
      }

      sx_ret = sx_aes_ccm_decrypt_verify_final(
        &key,
        &data_in_block,
        &data_out_block,
        &ctx_in_block,
        &tag_block);
      break;
    }
      #endif//PSA_WANT_ALG_CCM
      #if defined(PSA_WANT_ALG_GCM)
    case PSA_ALG_AEAD_WITH_SHORTENED_TAG(PSA_ALG_GCM, 0):
    {
      sx_ret = sx_aes_gcm_decrypt_verify_final(
        &key,
        &data_in_block,
        &data_out_block,
        &ctx_in_block,
        &tag_block,
        &len_a_c);
      break;
    }
      #endif//PSA_WANT_ALG_GCM
    default:
      return PSA_ERROR_NOT_SUPPORTED;
  }

  // Release ownership.
  status = cryptoacc_management_release();

  if (status != PSA_SUCCESS) {
    return PSA_ERROR_HARDWARE_FAILURE;
  }
  if (sx_ret == CRYPTOLIB_INVALID_SIGN_ERR) {
    return PSA_ERROR_INVALID_SIGNATURE;
  }
  if (sx_ret != PSA_SUCCESS) {
    return PSA_ERROR_HARDWARE_FAILURE;
  }

  *plaintext_length = operation->final_data_length;

  return PSA_SUCCESS;

  #else//PSA_WANT_ALG_CCM || PSA_WANT_ALG_GCM
  (void)operation;
  (void)plaintext;
  (void)plaintext_size;
  (void)plaintext_length;
  (void)tag;
  (void)tag_length;
  return PSA_ERROR_NOT_SUPPORTED;
  #endif//PSA_WANT_ALG_CCM || PSA_WANT_ALG_GCM
}

psa_status_t sli_cryptoacc_transparent_aead_abort(sli_cryptoacc_transparent_aead_operation_t *operation)
{
  // No state is ever left in HW, so zeroing context should do the trick
  if (operation == NULL) {
    return PSA_ERROR_INVALID_ARGUMENT;
  }

  memset(operation, 0, sizeof(*operation));
  return PSA_SUCCESS;
}

#endif // defined(CRYPTOACC_PRESENT)
